LceITC/stm32-ecg-spo2-monitor/Hardware/Src/ADC.c
#include "ADC.h"
#include "delay.h"
#include "stm32f10x.h"

/* ADC校准阶段允许等待的最长时间，避免硬件异常导致上电死循环。 */
#define ADC_CALIBRATION_TIMEOUT_MS 20U

/* 将上层来源枚举转换成SPL要求的ADC规则通道编号。 */
static uint8_t ADC_ECG_Channel(ADC_ECG_Source source)
{
    return source == ADC_ECG_SOURCE_DIRECT ? ADC_Channel_2 : ADC_Channel_0;
}

/* 只改写规则序列第1项，不改变ADC触发方式、采样时间和DMA配置。 */
void ADC_ECG_SelectSource(ADC_ECG_Source source)
{
    ADC_RegularChannelConfig(ADC1, ADC_ECG_Channel(source), 1U,
                             ADC_SampleTime_55Cycles5);
}

/*
 * AD8232 OUTPUT 接 PA0。ADC 不使用连续模式，每次转换均由
 * TIM2_CC2 的 100 Hz 事件触发，结果由 DMA1 Channel1 搬运。
 */
ADC_ECG_InitStatus ADC_ECG_Init(ADC_ECG_Source source)
{
    GPIO_InitTypeDef gpio; /* 保存PA0、PA2模拟输入的GPIO配置。 */
    ADC_InitTypeDef adc;   /* 保存ADC1单通道外部触发配置。 */
    uint32_t timeout_start; /* 记录每个校准阶段开始时的毫秒计数。 */

    /* ADC 时钟为 72 MHz / 6 = 12 MHz，满足 STM32F103 ADC 规格。 */
    RCC_APB2PeriphClockCmd(RCC_APB2Periph_GPIOA | RCC_APB2Periph_ADC1, ENABLE);
    RCC_ADCCLKConfig(RCC_PCLK2_Div6);

    /* PA0 采集 AD8232，PA2 采集信号发生器直测信号。 */
    gpio.GPIO_Pin = GPIO_Pin_0 | GPIO_Pin_2;
    gpio.GPIO_Mode = GPIO_Mode_AIN;
    GPIO_Init(GPIOA, &gpio);

    /* 单通道、非连续转换，外部触发源固定为 TIM2_CC2。 */
    ADC_DeInit(ADC1);
    adc.ADC_Mode = ADC_Mode_Independent;
    adc.ADC_ScanConvMode = DISABLE;
    adc.ADC_ContinuousConvMode = DISABLE;
    adc.ADC_ExternalTrigConv = ADC_ExternalTrigConv_T2_CC2;
    adc.ADC_DataAlign = ADC_DataAlign_Right;
    adc.ADC_NbrOfChannel = 1U;
    ADC_Init(ADC1, &adc);
    ADC_ECG_SelectSource(source);
    ADC_DMACmd(ADC1, ENABLE);
    ADC_Cmd(ADC1, ENABLE);

    /* 校准过程增加超时保护，避免硬件异常时程序永久阻塞。 */
    ADC_ResetCalibration(ADC1);
    timeout_start = GetTick();
    while (ADC_GetResetCalibrationStatus(ADC1) == SET)
    {
        if ((uint32_t)(GetTick() - timeout_start) >= ADC_CALIBRATION_TIMEOUT_MS)
        {
            return ADC_ECG_INIT_RESET_CALIBRATION_TIMEOUT;
        }
    }

    ADC_StartCalibration(ADC1);
    timeout_start = GetTick();
    while (ADC_GetCalibrationStatus(ADC1) == SET)
    {
        if ((uint32_t)(GetTick() - timeout_start) >= ADC_CALIBRATION_TIMEOUT_MS)
        {
            return ADC_ECG_INIT_CALIBRATION_TIMEOUT;
        }
    }

    /* 校准完成后才允许外部事件启动正式转换。 */
    ADC_ExternalTrigConvCmd(ADC1, ENABLE);
    return ADC_ECG_INIT_OK;
}
